Breaddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "SubBreaddit"], ["description", "It's time to get toasty!!"], ["mod_id", 1], ["created_at", "2019-06-12 00:41:22.046442"], ["updated_at", "2019-06-12 00:41:22.046442"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.mod_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sub
      @sub = Sub.find(params[:id])